[
  {
    "id": 1,
    "image": "https://images.unsplash.com/photo-1655199798153-a8f56d8655d2",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is a social networking platform that connects billions of users across the globe. It allows you to share posts, photos, and videos, follow your favorite pages, join interest-based groups, and connect with people who matter most. With a constantly evolving interface, Facebook makes it easier to discover trending news, find local events, or buy and sell through Marketplace. Whether you’re connecting with friends, following creators, or joining global conversations, Facebook offers a place where community and communication thrive every day.",
    "size": 78,
    "reviews": 55,
    "ratingAvg": 4.2,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 410000 },
      { "name": "2 star", "count": 210000 },
      { "name": "3 star", "count": 650000 },
      { "name": "4 star", "count": 2300000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "id": 2,
    "image": "https://images.unsplash.com/photo-1661269124571-63a0a342277d",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Messenger is Meta’s all-in-one communication platform that keeps you close to your friends, family, and communities. It supports text messages, voice calls, video chats, and group conversations, making it easy to stay connected anytime. You can share photos, videos, voice notes, stickers, and even play games together within the app. With powerful features like message reactions, polls, and custom chat themes, Messenger provides a fun, fast, and secure environment for conversations across devices — from mobile to desktop — backed by end-to-end encryption for privacy and peace of mind.",
    "size": 62,
    "reviews": 50,
    "ratingAvg": 4.3,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 95000 },
      { "name": "3 star", "count": 230000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "id": 3,
    "image": "https://images.unsplash.com/photo-1678329885908-85eb768aa61b",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s most popular video-sharing platform, empowering billions of users to watch, upload, and share videos on virtually every topic imaginable. From music and movies to education, gaming, and live streaming, YouTube offers endless entertainment and learning opportunities. You can subscribe to your favorite creators, comment, and curate personalized playlists for any mood. With AI-powered recommendations, offline downloads, and YouTube Premium ad-free viewing, the platform is built to bring global creativity and knowledge right to your fingertips, anytime and anywhere.",
    "size": 86,
    "reviews": 56,
    "ratingAvg": 4.8,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 210000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 270000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 4600000 }
    ]
  },
  {
    "id": 4,
    "image": "https://images.unsplash.com/photo-1614680376593-902f74cf0d41",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is a leading digital music, podcast, and audiobook streaming platform that gives you instant access to millions of tracks from artists all around the world. It lets you create custom playlists, discover new releases, and explore curated mixes tailored to your taste using powerful AI recommendations. Whether you’re working out, studying, or relaxing, Spotify adapts to your mood with its seamless interface, offline mode, and cross-device synchronization. From trending hits to independent artists, Spotify redefines how we experience sound and stories in our daily lives.",
    "size": 53,
    "reviews": 78,
    "ratingAvg": 4.7,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 13000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 27000 },
      { "name": "4 star", "count": 130000 },
      { "name": "5 star", "count": 960000 }
    ]
  },
  {
    "id": 5,
    "image": "https://images.unsplash.com/photo-1662947368791-8630979e964b",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping is your ultimate online store, offering millions of products across electronics, clothing, books, groceries, and more. With personalized recommendations, fast delivery options, and exclusive Prime benefits, it provides a seamless shopping experience right from your mobile device. Track your orders, browse deals, compare prices, and manage returns — all within one secure platform. The app’s intuitive design, powerful search, and one-click checkout make it one of the most convenient ways to shop and save both time and money in today’s digital world.",
    "size": 74,
    "reviews": 48,
    "ratingAvg": 4.5,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 98000 },
      { "name": "2 star", "count": 57000 },
      { "name": "3 star", "count": 130000 },
      { "name": "4 star", "count": 620000 },
      { "name": "5 star", "count": 2100000 }
    ]
  },
  {
    "id": 6,
    "image": "https://images.unsplash.com/photo-1661077150377-26922fb352bc",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is the world’s leading entertainment streaming platform, offering thousands of movies, series, documentaries, and original productions in every language and genre imaginable. From global blockbusters to indie hits, it delivers personalized recommendations that evolve with your taste. Watch seamlessly across all your devices, download for offline viewing, and enjoy a completely ad-free experience. With flexible plans and a constantly expanding library, Netflix transforms the way audiences around the world discover, enjoy, and connect through storytelling.",
    "size": 82,
    "reviews": 34,
    "ratingAvg": 4.5,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 87000 },
      { "name": "2 star", "count": 45000 },
      { "name": "3 star", "count": 140000 },
      { "name": "4 star", "count": 910000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 7,
    "image": "https://images.unsplash.com/photo-1641350625112-3b1d73c71418",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "description": "PayPal is a globally trusted digital payment solution that allows individuals and businesses to send, receive, and manage money securely online. Whether you’re shopping, transferring funds, or running a business, PayPal simplifies transactions through its intuitive interface and advanced fraud protection. You can link multiple bank accounts or cards, send payments in seconds, and even split bills with friends. Supporting multiple currencies and countries, PayPal is built to make global commerce safe, fast, and accessible to everyone with just a few taps.",
    "size": 59,
    "reviews": 49,
    "ratingAvg": 4.4,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 19000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 41000 },
      { "name": "4 star", "count": 230000 },
      { "name": "5 star", "count": 600000 }
    ]
  },
  {
    "id": 8,
    "image": "https://images.unsplash.com/photo-1683029096295-7680306aa37d",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord is a vibrant community-driven communication platform where millions of people connect through text, voice, and video. Whether you’re gaming, studying, working, or hanging out with friends, Discord provides powerful tools to create and manage your own servers. Customize roles, permissions, and channels, or integrate bots to enhance productivity and fun. From casual groups to professional teams, Discord offers reliable performance, cross-platform support, and a safe environment that brings people together through shared interests and creativity.",
    "size": 67,
    "reviews": 45,
    "ratingAvg": 4.6,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 21000 },
      { "name": "4 star", "count": 160000 },
      { "name": "5 star", "count": 520000 }
    ]
  },
  {
    "id": 9,
    "image": "https://images.unsplash.com/photo-1611162617263-4ec3060a058e",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a creative social platform that lets you capture life’s moments in fun and spontaneous ways. Share photos and short videos called Snaps that disappear after being viewed, or build Stories that highlight your day. Express yourself with filters, lenses, Bitmojis, and augmented reality effects that make every moment unique. Beyond messaging, Snapchat also connects you to the world through Discover, Spotlight, and location-based features. It’s more than just communication — it’s a place for self-expression, creativity, and connection in real time.",
    "size": 71,
    "reviews": 54,
    "ratingAvg": 4.3,
    "downloads": 2,
    "ratings": [
      { "name": "1 star", "count": 82000 },
      { "name": "2 star", "count": 42000 },
      { "name": "3 star", "count": 110000 },
      { "name": "4 star", "count": 620000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "id": 10,
    "image": "https://images.unsplash.com/photo-1554260570-83dc2f46ef79",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "description": "Uber revolutionized urban transportation by connecting riders with drivers through a fast, easy-to-use mobile app. Whether you need a quick ride across town, a premium car, or an affordable shared trip, Uber offers multiple options to suit your budget and schedule. The app provides live tracking, fare estimates, and secure payment options — no cash required. With global coverage and a focus on safety through real-time driver verification and ride-sharing insights, Uber continues to redefine the way people move in modern cities worldwide.",
    "size": 55,
    "reviews": 29,
    "ratingAvg": 4.4,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 62000 },
      { "name": "2 star", "count": 32000 },
      { "name": "3 star", "count": 92000 },
      { "name": "4 star", "count": 410000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 11,
    "image": "https://images.unsplash.com/photo-1694878981766-ed5fa0dfe9eb",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a global creative platform where millions of users create, share, and discover short-form videos every day. With a wide range of editing tools, filters, and trending audio clips, it empowers anyone to become a creator. Whether you’re dancing, cooking, teaching, or showcasing your art, TikTok’s personalized feed connects you with a diverse and engaged audience. Its AI-driven recommendations, viral challenges, and community interactions make it not just an entertainment hub, but also a space for learning, expression, and inspiration.",
    "size": 91,
    "reviews": 43,
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 155000 },
      { "name": "2 star", "count": 82000 },
      { "name": "3 star", "count": 210000 },
      { "name": "4 star", "count": 1020000 },
      { "name": "5 star", "count": 3000000 }
    ]
  },
  {
    "id": 12,
    "image": "https://images.unsplash.com/photo-1662947036644-ecfde1221ac7",
    "title": "Microsoft",
    "companyName": "Microsoft Corporation",
    "description": "Microsoft’s mobile productivity suite unites powerful tools like Word, Excel, PowerPoint, Outlook, and OneDrive into one seamless experience. It enables you to create, edit, and share documents on the go, ensuring your workflow stays uninterrupted across devices. With real-time collaboration, intelligent cloud synchronization, and deep AI integration, Microsoft helps individuals and teams stay organized and efficient. Whether you’re managing school projects, office reports, or personal tasks, it’s designed to keep your digital workspace secure, smart, and productive anywhere.",
    "size": 76,
    "reviews": 47,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 65000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1400000 }
    ]
  }
]
