[
  {
    "id": 1,
    "image": "https://images.unsplash.com/photo-1655199798153-a8f56d8655d2",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is a social networking platform that connects billions of users across the globe. It allows people to share posts, photos, and videos, follow favorite pages, join interest-based groups, and connect with those who matter most. With its constantly evolving interface, Facebook makes it easier to discover trending news, find local events, or even buy and sell through its Marketplace feature. Whether you're connecting with friends, following creators, or joining global conversations, Facebook offers a space where community and communication thrive every day.Founded in 2004 by Mark Zuckerberg and his college roommates, Facebook began as a simple platform for students to connect at Harvard University but quickly expanded into a worldwide social network. Over the years, it has evolved into a multifunctional digital hub for communication, entertainment, education, and business. Users can interact through likes, comments, shares, and messages, as well as create or follow pages and communities that reflect their interests.Facebook's ecosystem includes powerful features such as Stories, Reels, and Live Streaming, giving users creative ways to share moments and experiences. Businesses also benefit through Facebook Pages and Ads, which help brands promote their products, engage customers, and grow their online presence. Additionally, the Marketplace feature allows users to conveniently buy, sell, or trade items within their local areas. ",
    "size": 78,
    "reviews": 55,
    "ratingAvg": 4.2,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 410000 },
      { "name": "2 star", "count": 210000 },
      { "name": "3 star", "count": 650000 },
      { "name": "4 star", "count": 2300000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "id": 2,
    "image": "https://images.unsplash.com/photo-1661269124571-63a0a342277d",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Messenger is Meta’s all-in-one communication platform designed to keep people connected with their friends, family, and communities no matter where they are. Originally launched as part of Facebook and later developed into a standalone app, Messenger offers a wide range of features that make communication simple, fast, and interactive. Users can send instant text messages, share photos, videos, stickers, voice notes, and GIFs, or make voice and video calls with just a tap. The app also supports group chats, allowing multiple people to stay in touch and collaborate easily. Beyond basic messaging, Messenger includes engaging tools like reactions, polls, and custom chat themes, giving users the ability to personalize their conversations. It even integrates with Facebook and Instagram, making it possible to message contacts across both platforms seamlessly. With its cross-device compatibility, users can access their conversations on mobile phones, tablets, and desktop computers. Messenger also supports end-to-end encryption for private chats, ensuring that conversations remain secure and confidential. Over the years, it has expanded its functionality to include features such as Watch Together, location sharing, and payment options, turning it into a complete social communication hub. Today, Messenger stands as one of the most widely used messaging platforms in the world, connecting billions of people through fast, reliable, and secure digital interactions while continuing to evolve with Meta’s vision of a more connected and immersive online experience.",
    "size": 62,
    "reviews": 50,
    "ratingAvg": 4.3,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 95000 },
      { "name": "3 star", "count": 230000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "id": 3,
    "image": "https://images.unsplash.com/photo-1678329885908-85eb768aa61b",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world's most popular video-sharing platform, empowering billions of users to watch, upload, and share videos on virtually every topic imaginable. Founded in 2005 and now owned by Google, YouTube has revolutionized the way people consume and create content online. It serves as a hub for entertainment, education, creativity, and communication, offering everything from music videos, movie trailers, and gaming streams to tutorials, documentaries, and vlogs. Users can subscribe to their favorite creators, like and comment on videos, and create personalized playlists to match their interests and moods. With powerful features like AI-driven recommendations, live streaming, offline downloads, and YouTube Premium for ad-free viewing, the platform ensures a smooth and engaging experience for everyone. Creators can monetize their content through the YouTube Partner Program, turning their passion into a sustainable career, while brands use YouTube for advertising and audience engagement. The platform’s accessibility across mobile devices, computers, and smart TVs makes it an essential part of daily digital life. Beyond entertainment, YouTube plays a vital role in spreading knowledge, fostering creativity, and giving a voice to individuals and communities worldwide. It continues to evolve with new features, improving user experience and supporting the growing ecosystem of creators and viewers who rely on it for learning, inspiration, and connection every day.",
    "size": 86,
    "reviews": 56,
    "ratingAvg": 4.8,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 210000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 270000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 4600000 }
    ]
  },
  {
    "id": 4,
    "image": "https://images.unsplash.com/photo-1614680376593-902f74cf0d41",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is a leading digital music, podcast, and audiobook streaming platform that gives users instant access to millions of tracks, shows, and stories from artists and creators all around the world. Launched in 2008, Spotify revolutionized the way people experience audio by offering on-demand streaming and personalized listening experiences. It allows users to create custom playlists, explore curated mixes, and discover new music through powerful AI-driven recommendations that learn from their tastes and habits. Beyond just music, Spotify hosts an ever-growing collection of podcasts and audiobooks, making it a one-stop platform for both entertainment and learning. Its intuitive interface and seamless cross-device synchronization let users switch easily between mobile, desktop, smart speakers, and cars, ensuring continuous listening wherever they go. Spotify’s offline mode allows users to download tracks and enjoy their favorite content without an internet connection, while its Premium subscription offers an ad-free experience with enhanced sound quality. The platform also empowers artists by providing them a space to share their work globally, track performance insights, and engage directly with fans. Whether you’re working out, studying, or relaxing, Spotify adapts to your mood and lifestyle with playlists, genres, and recommendations tailored just for you. From trending global hits to underground independent sounds, Spotify continues to redefine how people discover, enjoy, and connect through music and stories, cementing its place as one of the most influential platforms in the modern digital era.",
    "size": 53,
    "reviews": 78,
    "ratingAvg": 4.7,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 13000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 27000 },
      { "name": "4 star", "count": 130000 },
      { "name": "5 star", "count": 960000 }
    ]
  },
  {
    "id": 5,
    "image": "https://images.unsplash.com/photo-1662947368791-8630979e964b",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping is your ultimate online retail platform, offering millions of products across every imaginable category, including electronics, clothing, books, home essentials, groceries, and more. Founded by Jeff Bezos in 1994, Amazon has transformed the way people shop by combining convenience, speed, and innovation. The Amazon Shopping app provides users with a personalized experience through smart recommendations based on browsing and purchase history. With features like lightning deals, product comparisons, customer reviews, and one-click checkout, it ensures an effortless and enjoyable shopping journey. Shoppers can track their orders in real time, manage returns, and explore exclusive offers all from one secure and easy-to-use interface. Amazon Prime members enjoy additional perks such as fast and free delivery, access to Prime Video and Music, and special Prime Day discounts, enhancing both value and convenience. The app’s powerful search engine, intuitive navigation, and seamless integration across devices make it one of the most efficient and reliable online marketplaces. Whether you’re buying daily essentials, discovering new brands, or shopping for special occasions, Amazon Shopping delivers a smooth, secure, and rewarding experience that saves time and money while redefining how people connect with products in today’s digital world.",
    "size": 74,
    "reviews": 48,
    "ratingAvg": 4.5,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 98000 },
      { "name": "2 star", "count": 57000 },
      { "name": "3 star", "count": 130000 },
      { "name": "4 star", "count": 620000 },
      { "name": "5 star", "count": 2100000 }
    ]
  },
  {
    "id": 6,
    "image": "https://images.unsplash.com/photo-1661077150377-26922fb352bc",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is the world's leading entertainment streaming platform, offering a vast collection of movies, TV series, documentaries, and original productions across every genre and language imaginable. Founded in 1997 and transformed into a streaming service in 2007, Netflix has revolutionized how audiences experience visual storytelling. From global blockbusters and award-winning originals to indie films and regional favorites, the platform caters to diverse tastes and cultures. Its intelligent recommendation system personalizes content suggestions based on viewing history, ensuring every user finds something they love. Netflix supports seamless streaming across smartphones, tablets, computers, and smart TVs, allowing users to switch devices without interruption. With features like offline downloads, multiple user profiles, parental controls, and various subscription plans, Netflix makes entertainment accessible and flexible for all types of viewers. The platform is completely ad-free, offering uninterrupted viewing experiences and high-quality streaming that adapts to internet speed. Beyond entertainment, Netflix has become a cultural powerhouse, influencing trends, inspiring discussions, and connecting people worldwide through the universal language of film and storytelling. Constantly evolving and expanding its global library, Netflix continues to redefine how the world watches and experiences on-demand entertainment in the digital age.",
    "size": 82,
    "reviews": 34,
    "ratingAvg": 4.5,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 87000 },
      { "name": "2 star", "count": 45000 },
      { "name": "3 star", "count": 140000 },
      { "name": "4 star", "count": 910000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 7,
    "image": "https://images.unsplash.com/photo-1641350625112-3b1d73c71418",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "description": "PayPal is a globally trusted digital payment platform that enables individuals and businesses to send, receive, and manage money securely online. Founded in 1998, it has become one of the most recognized and widely used financial technology services in the world. PayPal allows users to link multiple bank accounts, debit cards, or credit cards, providing a convenient and flexible way to make payments, transfer funds, and handle financial transactions from virtually anywhere. Whether you’re shopping online, paying bills, donating to causes, or running a business, PayPal simplifies payments with its user-friendly interface and quick processing system. Advanced encryption technology and fraud protection tools ensure that every transaction remains safe and secure. The platform supports multiple currencies and operates in over 200 countries, making cross-border commerce and international transfers easier than ever. Businesses benefit from PayPal’s invoicing, checkout integration, and merchant services that streamline online sales and improve customer trust. With added features like peer-to-peer payments, bill splitting, and mobile wallet access, PayPal continues to redefine the way people handle digital money, offering a reliable, fast, and accessible financial experience for users around the globe.",
    "size": 59,
    "reviews": 49,
    "ratingAvg": 4.4,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 19000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 41000 },
      { "name": "4 star", "count": 230000 },
      { "name": "5 star", "count": 600000 }
    ]
  },
  {
    "id": 8,
    "image": "https://images.unsplash.com/photo-1614680376739-414d95ff43df",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord is a vibrant, community-driven communication platform that brings together millions of users from around the world through text, voice, and video. Originally designed for gamers, Discord has evolved into a versatile space where people gather to connect, collaborate, and share ideas across countless interests — from gaming and music to education, technology, and professional networking. The platform allows users to create and customize their own servers with roles, permissions, and dedicated channels for specific topics or groups. With powerful moderation tools, seamless integrations, and support for bots, users can automate tasks, host events, and enhance both productivity and entertainment within their communities. Discord’s cross-platform compatibility ensures smooth performance across mobile devices, desktops, and web browsers, making it accessible anywhere. It also features high-quality voice and video chat, screen sharing, and streaming options, ideal for both casual hangouts and organized team meetings. Privacy and security are core priorities, with features like two-factor authentication, content filters, and advanced permission systems. Whether you’re managing a study group, running a fan community, or building a professional network, Discord offers a dynamic and safe environment that encourages collaboration, creativity, and genuine human connection in the digital world.",
    "size": 67,
    "reviews": 45,
    "ratingAvg": 4.6,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 21000 },
      { "name": "4 star", "count": 160000 },
      { "name": "5 star", "count": 520000 }
    ]
  },
  {
    "id": 9,
    "image": "https://images.unsplash.com/photo-1611162617263-4ec3060a058e",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a creative and dynamic social media platform that allows users to capture and share life’s moments in spontaneous and engaging ways. Launched in 2011, Snapchat revolutionized digital communication by introducing disappearing photos and videos known as “Snaps,” encouraging more authentic and in-the-moment sharing. Users can send Snaps privately or post them to their Stories, which showcase highlights of their day for friends to view within a limited time. The platform is known for its fun and expressive features, including filters, lenses, Bitmojis, and augmented reality (AR) effects that transform everyday moments into something playful and unique. Beyond personal messaging, Snapchat connects users to a wider world through Discover — a space featuring news, entertainment, and content from creators and brands — and Spotlight, where the community shares creative short videos. Location-based features like Snap Map let friends see what’s happening around the world in real time. With a focus on privacy, creativity, and visual storytelling, Snapchat continues to redefine how people communicate, blending technology and imagination to make every interaction more personal, fun, and meaningful.",
    "size": 71,
    "reviews": 54,
    "ratingAvg": 4.3,
    "downloads": 2,
    "ratings": [
      { "name": "1 star", "count": 82000 },
      { "name": "2 star", "count": 42000 },
      { "name": "3 star", "count": 110000 },
      { "name": "4 star", "count": 620000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "id": 10,
    "image": "https://images.unsplash.com/photo-1657947953120-6e5201f3b3ed",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "description": "Uber is a global technology platform that has revolutionized urban transportation by seamlessly connecting riders with drivers through an easy-to-use mobile app. Founded in 2009, Uber has transformed the way people move by offering fast, reliable, and affordable rides at the tap of a button. Whether you're looking for a quick trip across town, a luxury car experience, or an economical shared ride, Uber provides multiple options to match every budget and schedule. The app features live GPS tracking, upfront fare estimates, and secure in-app payment options — eliminating the need for cash and ensuring convenience for both riders and drivers. Uber's commitment to safety is reflected through real-time driver verification, trip-sharing capabilities, and 24/7 support, giving users peace of mind throughout their journey. Operating in hundreds of cities around the world, Uber's platform extends beyond ridesharing to include services like Uber Eats for food delivery, Uber Freight for logistics, and Uber for Business solutions. With its focus on innovation, efficiency, and accessibility, Uber continues to redefine modern urban mobility — making transportation smarter, faster, and more connected for millions of people globally.",
    "size": 55,
    "reviews": 29,
    "ratingAvg": 4.4,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 62000 },
      { "name": "2 star", "count": 32000 },
      { "name": "3 star", "count": 92000 },
      { "name": "4 star", "count": 410000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 11,
    "image": "https://images.unsplash.com/photo-1694878981766-ed5fa0dfe9eb",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a global creative platform that has transformed the way people create, share, and experience short-form video content. Launched in 2016, TikTok empowers millions of users around the world to express themselves through 15-second to 10-minute videos that cover virtually every topic imaginable — from dance and comedy to cooking, education, fashion, and art. The app offers an extensive suite of editing tools, effects, filters, and trending audio clips that make content creation fun, accessible, and professional-looking even for beginners. Its powerful AI-driven recommendation system curates a personalized feed, known as the “For You Page,” that adapts to each user’s interests and engagement patterns, helping creators reach vast audiences quickly. TikTok has become more than just an entertainment hub; it’s a platform for discovery, learning, and cultural influence, where trends, challenges, and viral moments are born daily. With features like live streaming, duets, and stitches, users can collaborate, interact, and build communities across the globe. The platform also promotes digital safety with content moderation, privacy controls, and parental guidance options. Constantly evolving with new tools and formats, TikTok continues to redefine social media by blending creativity, technology, and connection — inspiring a new generation of creators and audiences worldwide.",
    "size": 91,
    "reviews": 43,
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 155000 },
      { "name": "2 star", "count": 82000 },
      { "name": "3 star", "count": 210000 },
      { "name": "4 star", "count": 1020000 },
      { "name": "5 star", "count": 3000000 }
    ]
  },
  {
    "id": 12,
    "image": "https://images.unsplash.com/photo-1662947036644-ecfde1221ac7",
    "title": "Microsoft",
    "companyName": "Microsoft Corporation",
    "description": "Microsoft’s mobile productivity suite brings together the full power of Word, Excel, PowerPoint, Outlook, and OneDrive into a unified, intelligent ecosystem designed to help you work smarter and faster. Whether you’re writing documents, analyzing data, building presentations, or managing your inbox, Microsoft ensures a smooth and consistent experience across mobile, desktop, and web. The suite enables seamless real-time collaboration, allowing multiple users to co-edit files simultaneously while maintaining version control and data integrity. With OneDrive integration, your files are automatically synced and securely stored in the cloud, so your work is always accessible — anytime, anywhere. Advanced AI features like predictive text, smart suggestions, and task automation help boost productivity and reduce manual effort. Beyond work, it’s ideal for students, freelancers, and professionals who want to stay organized with integrated tools for scheduling, note-taking, and communication. Enhanced security measures, such as encrypted data sharing and two-factor authentication, protect sensitive information at every level. Constantly updated with new features and intelligent enhancements, Microsoft’s mobile productivity suite empowers individuals and teams to collaborate effectively, stay connected, and achieve more — all from the convenience of their mobile devices.",
    "size": 76,
    "reviews": 47,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 65000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 13,
    "image": "https://images.unsplash.com/photo-1637592156141-d41fb6234e71",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "description": "Zoom is a leading video conferencing platform that connects people through high-quality video, voice, chat, and content sharing. Designed for meetings, webinars, and online collaboration, Zoom allows users to host secure and reliable virtual sessions across any device. With features like breakout rooms, screen sharing, cloud recording, and live transcription, it provides a smooth experience for both personal and professional communication. Its intuitive interface, cross-platform support, and powerful integrations make Zoom the preferred choice for remote teams, educators, and businesses worldwide.",
    "size": 120,
    "reviews": 52,
    "ratingAvg": 4.6,
    "downloads": 11,
    "ratings": [
      { "name": "1 star", "count": 45000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 14,
    "image": "https://images.unsplash.com/photo-1649180559928-91d16a63bd39",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "description": "Slack is a powerful communication and collaboration platform that brings teams together in one organized space. It enables real-time messaging, file sharing, and integrations with hundreds of tools like Google Drive, Trello, and Asana. With dedicated channels, threads, and advanced search, Slack helps teams stay productive and aligned. Its customizable workflows and app integrations make it ideal for startups and enterprises alike. Whether you’re working remotely or in an office, Slack simplifies teamwork and keeps communication transparent, fast, and efficient.",
    "size": 89,
    "reviews": 36,
    "ratingAvg": 4.4,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 350000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 15,
    "image": "https://images.unsplash.com/photo-1663813064379-e35ad59c486d",
    "title": "Notion",
    "companyName": "Notion Labs Inc.",
    "description": "Notion is an all-in-one workspace for notes, projects, tasks, and databases. It combines the functionality of a document editor, spreadsheet, and task manager into one flexible platform. Ideal for both individuals and teams, Notion helps you organize your life and work with customizable templates, drag-and-drop blocks, and real-time collaboration. Whether you’re managing personal goals, tracking projects, or documenting company processes, Notion adapts to your workflow. With offline access, integrations, and seamless syncing, it’s the ultimate tool for structured creativity and productivity.",
    "size": 95,
    "reviews": 41,
    "ratingAvg": 4.8,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 1150000 }
    ]
  },
  {
    "id": 16,
    "image": "https://images.unsplash.com/photo-1706879349268-8cb3a9ae739a",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Gmail is a widely used email service developed by Google that provides fast, secure, and reliable communication for personal and professional use. It offers an intuitive interface, advanced search, and powerful organizational tools like labels, filters, and categories to help users manage their inbox efficiently. With integrated Google Workspace support, Gmail seamlessly connects with Google Drive, Calendar, Meet, and Chat, enabling smooth collaboration and productivity. Features such as spam protection, smart replies, and confidential mode ensure both security and convenience. Gmail is accessible across all devices, providing instant notifications, offline access, and reliable synchronization, making it an essential tool for managing emails and staying connected in today’s digital world.",
    "size": 85,
    "reviews": 64,
    "ratingAvg": 4.8,
    "downloads": 15,
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 1350000 }
    ]
},
  {
    "id": 17,
    "image": "https://images.unsplash.com/photo-1642724978334-218b27d2c472",
    "title": "WhatsApp",
    "companyName": "Meta Platforms Inc.",
    "description": "WhatsApp is a globally popular messaging platform that allows users to send text messages, voice notes, photos, videos, and documents securely. It supports one-on-one chats, group conversations, and voice or video calls, making it an all-in-one communication tool. With end-to-end encryption, WhatsApp ensures privacy and security for all conversations. The app also offers features like Status updates, media sharing, location sharing, and desktop access via WhatsApp Web. Designed for simplicity and speed, WhatsApp keeps users connected seamlessly across devices, supporting personal and business communication worldwide.",
    "size": 95,
    "reviews": 72,
    "ratingAvg": 4.8,
    "downloads": 18,
    "ratings": [
      { "name": "1 star", "count": 18000 },
      { "name": "2 star", "count": 12000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1500000 }
    ]
  }
]
